uhnp/src/DataProcessors/АналитическийБланкСводнаяТаблица/АналитическийБланкСводнаяТаблица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>АналитическийБланкСводнаяТаблица</name>
  <tabularSections>
    <name>ТаблицаИзмененныхПоказателей</name>
    <attributes>
      <name>Сценарий</name>
      <type>
        <types>CatalogRef.Сценарии</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодОтчета</name>
      <type>
        <types>CatalogRef.Периоды</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательОтчета</name>
      <type>
        <types>CatalogRef.ПоказателиОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика1</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика2</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика3</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика4</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика5</name>
      <type>
        <types>CatalogRef.ПроизвольныйКлассификаторУХ</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсходноеЗначение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>5</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаВалюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеВалюта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СинтетическоеЗначение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеЗаблокировано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИндексСостояния</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

uhnp/src/Enums/ПостоянныеПоляСводнойТаблицы/ПостоянныеПоляСводнойТаблицы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПостоянныеПоляСводнойТаблицы</name>
  <enumValues>
    <name>СтрокиОтчетов</name>
  </enumValues>
  <enumValues>
    <name>КолонкиОтчетов</name>
  </enumValues>
  <enumValues>
    <name>Сценарий</name>
  </enumValues>
  <enumValues>
    <name>ПериодОтчета</name>
  </enumValues>
  <enumValues>
    <name>Организация</name>
  </enumValues>
  <enumValues>
    <name>Проект</name>
  </enumValues>
  <enumValues>
    <name>Версия</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВидыКолонокСводнойТаблицы/ВидыКолонокСводнойТаблицы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКолонокСводнойТаблицы</name>
  <enumValues>
    <name>БазовоеЗначение</name>
  </enumValues>
  <enumValues>
    <name>ОтклонениеАБС</name>
  </enumValues>
  <enumValues>
    <name>ОтклонениеОтн</name>
  </enumValues>
  <enumValues>
    <name>Формула</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/DataProcessors/АналитическийБланкСводнаяТаблица/Forms/ФормаНастройкиУсловногоОформления/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)


	Обработки.АналитическийБланкСводнаяТаблица.СоздатьРеквизитыНастроекСводнойТаблицы(ЭтаФорма);
	НастройкиПолейСводнойТаблицы =  ПолучитьИзВременногоХранилища(Параметры.НастройкиПолейСводнойТаблицыАдрес);
	
	СКДТекущегоПоля = ПолучитьОбщийМакет("МакетНастройкиОтборов");

	Для Каждого СтрАналитика Из НастройкиПолейСводнойТаблицы Цикл
		
		Если СтрАналитика.Поле = Перечисления.ПостоянныеПоляСводнойТаблицы.СтрокиОтчетов 
			ИЛИ  СтрАналитика.Поле = Перечисления.ПостоянныеПоляСводнойТаблицы.КолонкиОтчетов
			ИЛИ  СтрАналитика.ЭтоПроизводноеПоле Тогда
			Продолжить;
		КонецЕсли;	
		
		МассивТипов = Новый Массив;
	
		Если СтрАналитика.Поле = Перечисления.ПостоянныеПоляСводнойТаблицы.Организация Тогда
			МассивТипов.Добавить(Тип("СправочникСсылка.Организации"));			
		ИначеЕсли СтрАналитика.Поле = Перечисления.ПостоянныеПоляСводнойТаблицы.Проект Тогда 	
			МассивТипов.Добавить(Тип("СправочникСсылка.Проекты"));			
		ИначеЕсли СтрАналитика.Поле = Перечисления.ПостоянныеПоляСводнойТаблицы.Сценарий Тогда 	
			МассивТипов.Добавить(Тип("СправочникСсылка.Сценарии"));			
		ИначеЕсли СтрАналитика.Поле = Перечисления.ПостоянныеПоляСводнойТаблицы.ПериодОтчета Тогда 	
			МассивТипов.Добавить(Тип("СправочникСсылка.Периоды"));						
		Иначе	
			Для Каждого СтрТип Из СтрАналитика.Поле.ТипЗначения.Типы() Цикл
				МассивТипов.Добавить(СтрТип);
			КонецЦикла;		
		КонецЕсли;	
		
		НП =  СКДТекущегоПоля.НаборыДанных[0].Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		НП.Заголовок		= Строка(СтрАналитика.Поле);
		НП.ПутьКДанным 		= СтрАналитика.КодПоля;
		НП.ТипЗначения 		= Новый ОписаниеТипов(МассивТипов);
		НП.Поле 			= СтрАналитика.КодПоля;	
			
		
	КонецЦикла;	
	
	//Отдельно добавляем поля "значения", по ним тоже можно делать отбор
	ПолеЧисло = "ЗначениеЧисло";
	//
	НП =  СКДТекущегоПоля.НаборыДанных[0].Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НП.Заголовок		= НСтр("ru = 'Значение (число)'");
	НП.ПутьКДанным 		= ПолеЧисло;
	НП.ТипЗначения 		= Новый ОписаниеТипов("Число");
	НП.Поле 			= ПолеЧисло;	
		
	ПолеНеЧисло = "ЗначениеДата";
	
	НП =  СКДТекущегоПоля.НаборыДанных[0].Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НП.Заголовок		= НСтр("ru = 'Значение (дата)'");
	НП.ПутьКДанным 		= ПолеНеЧисло;
	НП.ТипЗначения 		= Новый ОписаниеТипов("Дата");
	НП.Поле 			= ПолеНеЧисло;	
	
	ПолеНеЧисло = "ЗначениеСтрока";
	
	НП =  СКДТекущегоПоля.НаборыДанных[0].Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НП.Заголовок		= НСтр("ru = 'Значение (строка)'");
	НП.ПутьКДанным 		= ПолеНеЧисло;
	НП.ТипЗначения 		= Новый ОписаниеТипов("Строка");
	НП.Поле 			= ПолеНеЧисло;	
	
	ПолеНеЧисло = "ЗначениеБулево";

	НП =  СКДТекущегоПоля.НаборыДанных[0].Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НП.Заголовок		= НСтр("ru = 'Значение (булево)'");
	НП.ПутьКДанным 		= ПолеНеЧисло;
	НП.ТипЗначения 		= Новый ОписаниеТипов("Булево");
	НП.Поле 			= ПолеНеЧисло;	
		
	СКДДоступныхПолейАдрес = ПоместитьВоВременноеХранилище(СКДТекущегоПоля,ЭтаФорма.УникальныйИдентификатор);
	 
	//Доступные колонки для выбора
	НастройкиСоставаКолонокСводнойТаблицы =  ПолучитьИзВременногоХранилища(Параметры.НастройкиСоставаКолонокСводнойТаблицыАдрес);
	
	Для Каждого СтрКолонка Из НастройкиСоставаКолонокСводнойТаблицы Цикл
		
		Если СтрКолонка.ТипКолонки = Перечисления.ВидыКолонокСводнойТаблицы.Формула Тогда
			НоваяДоступнаяКолонка = СписокДоступныхКолонок.Добавить(СтрКолонка.ФормулаСводнойТаблицы,СтрКолонка.ПредставлениеКолонки);		
		Иначе	
			НоваяДоступнаяКолонка = СписокДоступныхКолонок.Добавить(СтрКолонка.КолонкаОтчета,СтрКолонка.ПредставлениеКолонки);		
		КонецЕсли;
		
	КонецЦикла;	
		
	
	//Доступные строки для выбора
	НастройкиСоставаСтрокСводнойТаблицы =  ПолучитьИзВременногоХранилища(Параметры.НастройкиСоставаСтрокСводнойТаблицыАдрес);
	
	Для Каждого СтрСтрока Из НастройкиСоставаСтрокСводнойТаблицы Цикл
		
		Если СтрСтрока.ЭтоФормула Тогда
			НоваяДоступнаяСтрока = СписокДоступныхСтрок.Добавить(СтрСтрока.ФормулаСводнойТаблицы,СтрСтрока.ЗаголовокФормулы);		
		Иначе	
			НоваяДоступнаяСтрока = СписокДоступныхСтрок.Добавить(СтрСтрока.СтрокаОтчета,СтрСтрока.ЗаголовокФормулы);		
		КонецЕсли;
				
	КонецЦикла;	
		
				
	НастройкиУсловногоОформленияАдрес 					= Параметры.НастройкиУсловногоОформленияСводнойТаблицыАдрес;	
	НастройкиУсловногоОформленияСводнойТаблицыПараметр 	= ПолучитьИзВременногоХранилища(НастройкиУсловногоОформленияАдрес);
	
	Для Каждого ПараметрУО Из НастройкиУсловногоОформленияСводнойТаблицыПараметр Цикл
		
		НоваяСтрокаОформления = ЭтаФорма["УсловноеОформлениеСводнойТаблицы"].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаОформления,ПараметрУО);	
			
	КонецЦикла;	

	
	
	ЕстьСтрокиКолоноки();
	
КонецПроцедуры


&НаКлиенте
Процедура Применить(Команда)
	
	Закрыть(Новый Структура("НастройкиУсловногоОформленияСводнойТаблицыАдрес",ПолучитьНастройкиОформления()));

КонецПроцедуры

&НаСервере
Функция ПолучитьНастройкиОформления()
	
	Для Каждого СтрокаОформления Из УсловноеОформлениеСводнойТаблицы Цикл
			
		СтрокаОформления.ПараметрыУсловногоОформления.Очистить();
		
		Для Каждого СтрПараметрОформления Из СтрокаОформления.Оформление Цикл
			
			СтрокаОформления.ПараметрыУсловногоОформления.Добавить(СтрПараметрОформления.Значение,СтрПараметрОформления.Представление,СтрПараметрОформления.Пометка);
			
		КонецЦикла;	
	
	КонецЦикла;	
		
	Возврат ПоместитьВоВременноеХранилище(УсловноеОформлениеСводнойТаблицы.Выгрузить(),УникальныйИдентификатор);

КонецФункции	

&НаКлиенте
Процедура УсловноеОформлениеУсловиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ИзменениеОтборовУсловногоОформленияЗавершение", ЭтаФорма);		
	Параметры_ = Новый Структура("СКДДоступныхПолейАдрес,ТекущийОтбор",СКДДоступныхПолейАдрес,Элементы.УсловноеОформление.ТекущиеДанные["Условие"]); 		
	ОткрытьФорму("Обработка.АналитическийБланкСводнаяТаблица.Форма.ФормаУсловийОформления",Параметры_,ЭтаФорма,Истина,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеОтборовУсловногоОформленияЗавершение(Результат, ДополнительныеПараметры) Экспорт      
	
	Если Результат = Неопределено  Или Результат = КодВозвратаДиалога.Отмена  Тогда
		Возврат;
	КонецЕсли;	
	
	Элементы.УсловноеОформление.ТекущиеДанные.Условие = Результат;
	
КонецПроцедуры

&НаКлиенте
Процедура УсловноеОформлениеОформляемыеСтрокиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ИзменениеОформляемыхСтрокЗавершение", ЭтаФорма);		
	Параметры_ = Новый Структура("СписокДоступныхСтрокКолонок,СписокВыбранныхСтрокКолонок,ЭтоСтроки"
	,СписокДоступныхСтрок
	,Элементы.УсловноеОформление.ТекущиеДанные["ОформляемыеСтроки"]
	,Истина); 		
	
	
	ОткрытьФорму("Обработка.АналитическийБланкСводнаяТаблица.Форма.ФормаВыбораОформляемыхСтрокКолонок",Параметры_,ЭтаФорма,Истина,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
		
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеОформляемыхСтрокЗавершение(Результат, ДополнительныеПараметры) Экспорт      
	
	Если Результат = Неопределено  Или Результат = КодВозвратаДиалога.Отмена  Тогда
		Возврат;
	КонецЕсли;	
	
	Элементы.УсловноеОформление.ТекущиеДанные.ОформляемыеСтроки = Результат;
	
	ЕстьСтрокиКолоноки();
	
КонецПроцедуры

&НаКлиенте
Процедура УсловноеОформлениеОформляемыеКолонкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ИзменениеОформляемыхКолонокЗавершение", ЭтаФорма);		
	Параметры_ = Новый Структура("СписокДоступныхСтрокКолонок,СписокВыбранныхСтрокКолонок,ЭтоКолонки"
	,СписокДоступныхКолонок
	,Элементы.УсловноеОформление.ТекущиеДанные["ОформляемыеПоля"]
	,Истина); 		
	ОткрытьФорму("Обработка.АналитическийБланкСводнаяТаблица.Форма.ФормаВыбораОформляемыхСтрокКолонок",Параметры_,ЭтаФорма,Истина,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
		
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеОформляемыхКолонокЗавершение(Результат, ДополнительныеПараметры) Экспорт      
	
	Если Результат = Неопределено  Или Результат = КодВозвратаДиалога.Отмена  Тогда
		Возврат;
	КонецЕсли;	
	
	Элементы.УсловноеОформление.ТекущиеДанные.ОформляемыеПоля = Результат;
	
	ЕстьСтрокиКолоноки();
	
КонецПроцедуры 


Процедура ЕстьСтрокиКолоноки() 
	
	Для Каждого ЭлементоУО Из УсловноеОформлениеСводнойТаблицы Цикл
		
		ЭлементоУО.ЕстьОформляемыеПоля 		= ЭлементоУО.ОформляемыеПоля.Количество()>0;
		ЭлементоУО.ЕстьОформляемыеСтроки 	= ЭлементоУО.ОформляемыеСтроки.Количество()>0;
	
	КонецЦикла;	

КонецПроцедуры	

&НаКлиенте
Процедура УсловноеОформлениеОформлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ИзменениеПараметровУсловногоОформленияЗавершение", ЭтаФорма);		
	Параметры_ = Новый Структура("Оформление",Элементы.УсловноеОформление.ТекущиеДанные["Оформление"]); 		
	ОткрытьФорму("Обработка.АналитическийБланкСводнаяТаблица.Форма.ФормаВыбораОформляемыхСвойств",Параметры_,ЭтаФорма,Истина,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
КонецПроцедуры
	
&НаКлиенте
Процедура ИзменениеПараметровУсловногоОформленияЗавершение(Результат, ДополнительныеПараметры) Экспорт      
	
	Если Результат = Неопределено  Или Результат = КодВозвратаДиалога.Отмена  Тогда
		Возврат;
	КонецЕсли;	
	
    Элементы.УсловноеОформление.ТекущиеДанные.Оформление = Результат;

	
КонецПроцедуры

&НаКлиенте
Процедура УсловноеОформлениеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Не Копирование Тогда
        Элемент.ТекущиеДанные.Использовать = Истина;
    КонецЕсли;

КонецПроцедуры
